tap "anomalyco/tap"
tap "koekeishiya/formulae"
brew "python@3.14"
brew "tree"
brew "ansible"
brew "atuin"
brew "bash"
brew "bazelisk"
brew "btop"
brew "ccache"
brew "cmake"
brew "coreutils"
brew "dprint"
brew "flock"
brew "node"
brew "gemini-cli"
brew "gh"
brew "tesseract"
brew "git-lfs"
brew "openjdk"
brew "google-java-format"
brew "grep"
brew "htop"
brew "m4"
brew "imagemagick"
brew "jinja2-cli"
brew "just"
brew "mas"
brew "multitail"
brew "neovim"
brew "neovide"
brew "nvm"
brew "pkgconf"
brew "pre-commit"
brew "protobuf"
brew "ripgrep"
brew "rustup"
brew "shellcheck"
brew "shfmt"
brew "starship"
brew "taplo"
brew "texlive"
brew "the_silver_searcher"
brew "typst"
brew "uv"
brew "yq"
brew "z3"
brew "zeromq"
brew "zoxide"
brew "anomalyco/tap/opencode"
cask "1password-cli"
cask "amethyst"
cask "antigravity"
cask "caffeine"
cask "chatgpt"
cask "claude-code"
cask "codex"
cask "font-computer-modern"
cask "font-fira-code"
cask "font-fira-sans"
cask "font-source-code-pro"
cask "gcloud-cli"
cask "ghostty"
cask "lm-studio"
cask "neovide-app"
cask "obsidian"
cask "raycast"
cask "scrivener"
cask "spotify"
cask "tla+-toolbox"
cask "vlc"
cask "zed"
mas "Developer", id: 640199958
mas "Slack", id: 803453959
cargo "cargo-fuzz"
