# CLI
brew "neovim"
brew "ripgrep"
brew "fd"
brew "the_silver_searcher"
brew "tree"
brew "btop"
brew "htop"
brew "git-lfs"
brew "gh"
brew "just"
brew "zoxide"
brew "coreutils"
brew "grep"
brew "mas"

# Languages
brew "node"
brew "nvm"
brew "rustup"
brew "python@3.14"
brew "uv"
brew "openjdk"
brew "z3"

# Build
brew "cmake"
brew "bazelisk"
brew "ccache"
brew "pre-commit"

# AI
brew "gemini-cli"
brew "opencode"

# Documents
brew "texlive"
brew "typst"
brew "imagemagick"
brew "tesseract"

# Utils
brew "taplo"
brew "dprint"
brew "yq"
brew "jinja2-cli"

# Apps
cask "ghostty"
cask "zed"
cask "neovide-app"
cask "chatgpt"
cask "claude-code"
cask "codex"
cask "lm-studio"
cask "obsidian"
cask "1password-cli"
cask "amethyst"
cask "caffeine"
cask "raycast"
cask "scrivener"
cask "spotify"
cask "vlc"
cask "gcloud-cli"
cask "tla-plus-toolbox"

# Fonts
cask "font-fira-code"
cask "font-fira-sans"
cask "font-source-code-pro"
cask "font-computer-modern"

# App Store
mas "Perplexity: Ask Anything", id: 6714467650
