# Brewfile for macOS development setup
# Usage: brew bundle install

# Taps
tap "homebrew/bundle"
tap "homebrew/cask-fonts"

# =============================================================================
# CLI Tools
# =============================================================================

# Core Development Tools
brew "neovim"           # Modern vim
brew "ripgrep"          # Fast grep alternative
brew "the_silver_searcher" # ag search
brew "tree"             # Directory tree view
brew "btop"             # Resource monitor
brew "htop"             # Process viewer
brew "git-lfs"          # Git large file storage
brew "gh"               # GitHub CLI
brew "just"             # Command runner (modern make)
brew "zoxide"           # Smarter cd command

# Languages & Runtimes
brew "node"             # Node.js
brew "rustup"           # Rust toolchain manager
brew "python@3.14"      # Python
brew "uv"               # Fast Python package manager
brew "openjdk"          # Java JDK

# Build Tools
brew "cmake"            # Build system
brew "bazelisk"         # Bazel version manager
brew "ccache"           # Compiler cache
brew "pre-commit"       # Git hooks framework

# AI/LLM Tools
brew "opencode"         # AI coding assistant

# Document & Text Processing
brew "texlive"          # LaTeX distribution
brew "typst"            # Modern typesetting
brew "imagemagick"      # Image manipulation
brew "tesseract"        # OCR engine

# Other Utilities
brew "taplo"            # TOML toolkit
brew "dprint"           # Code formatter
brew "yq"               # YAML processor
brew "jinja2-cli"       # Jinja2 CLI

# Shell enhancements
brew "coreutils"        # GNU core utilities
brew "grep"             # GNU grep
brew "mas"              # Mac App Store CLI

# =============================================================================
# GUI Applications (Casks)
# =============================================================================

# Terminals & Editors
cask "ghostty"          # GPU-accelerated terminal
cask "zed"              # Modern code editor

# AI Applications
cask "claude-code"      # Anthropic Claude Code
cask "codex"            # OpenAI Codex CLI
cask "lm-studio"        # Local LLM runner

# Productivity
cask "obsidian"         # Knowledge base / notes
cask "1password-cli"    # Password manager CLI
cask "amethyst"         # Tiling window manager
cask "caffeine"         # Prevent sleep
cask "raycast"          # Launcher and productivity

# Writing
cask "scrivener"        # Writing app

# Media
cask "spotify"          # Music streaming

# Cloud
cask "gcloud-cli"       # Google Cloud SDK

# =============================================================================
# Fonts
# =============================================================================

cask "font-fira-code"           # Monospace with ligatures
cask "font-fira-sans"           # Sans-serif
cask "font-source-code-pro"     # Adobe monospace
cask "font-computer-modern"     # LaTeX default font

# =============================================================================
# Mac App Store
# =============================================================================

mas "Perplexity: Ask Anything", id: 6714467650
